package org.mpei.nti.substation.substationStructures.Enums;

public enum ProtectionType {
    DZL,    //Дифференциальная защита линий
    MTZ,    //Максимальная токовая защита
    TZNP,   //Токовая защита нулевой последовательности
    DZ,     //Дистанционная защита
    DZSH,   //Дифференциальная защита шин
    DZT,    //Дифференциальная защита трансформатора
    MFTO,   //Междуфазная токовая отсечка
    AMTZ,   //Аварийная максимальная токовая защита
    TZP,    //Токовая защита при перегрузке
    ZNR     //Защита от неполнофазного режима
}
