package org.mpei.nti.substation.substationStructures.Enums;

public enum ProtectionType {
    DZL,    //Дифференциальная защита линий
    MTZ,    //Максимальная токовая защита
    TZNP,   //Токовая защита нулевой последовательности
    DZ,     //Дистанционная защита
    DZSH,   //Дифференциальная защита шин
    MFTO,   //Междуфазная токовая отсечка
    AMTZ,   //Аварийная максимальная токовая защита
    TZP,    //Токовая защита при перегрузке
    ZNR,     //Защита от неполнофазного режима
    DZT,    //Дифференциальная защита трансформатора
    DZO,    //Дифференциальная зашита ошиновок
    DTZNP,  //Дифференциальная токовая защита нулевой последовательности
    GZ,     //Газовая защита
    LZSH,   //Логическая защита шин
    ZP,      //Защита от перегрузки
    ZOZZ,    //Защита от однофазных замыканий на землб
    ZMN,    //Защита минимального напряжения
    ZDZ    //Защита от дуговых замыканий

}
